#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.eks.data.aws_caller_identity.current[0]: Reading...
module.eks.data.aws_partition.current[0]: Reading...
module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
module.eks.data.aws_iam_policy_document.node_assume_role_policy[0]: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
data.aws_caller_identity.current: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-04da2c81b1ab04ffe]
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/common-eks/cluster]
module.eks.module.kms.data.aws_partition.current[0]: Reading...
module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks.data.aws_iam_policy_document.node_assume_role_policy[0]: Read complete after 0s [id=3518401652]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2830595799]
module.eks.aws_iam_role.eks_auto[0]: Refreshing state... [id=common-eks-eks-auto-20241225145555607900000004]
module.eks.aws_iam_role.this[0]: Refreshing state... [id=common-eks-cluster-20241225145555607300000003]
module.eks.data.aws_iam_policy_document.custom[0]: Reading...
module.eks.data.aws_iam_policy_document.custom[0]: Read complete after 0s [id=513122117]
module.eks.aws_iam_policy.custom[0]: Refreshing state... [id=arn:aws:iam::183631350996:policy/common-eks-cluster-20241225145555608700000005]
module.eks.data.aws_caller_identity.current[0]: Read complete after 0s [id=183631350996]
module.eks.data.aws_iam_session_context.current[0]: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=183631350996]
module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=183631350996]
module.eks.data.aws_iam_session_context.current[0]: Read complete after 0s [id=arn:aws:sts::183631350996:assumed-role/IaC-ReadOnly/GitHubActions]
module.eks.aws_iam_role_policy_attachment.eks_auto["AmazonEC2ContainerRegistryPullOnly"]: Refreshing state... [id=common-eks-eks-auto-20241225145555607900000004-20241225145556080600000007]
module.eks.aws_iam_role_policy_attachment.eks_auto["AmazonEKSWorkerNodeMinimalPolicy"]: Refreshing state... [id=common-eks-eks-auto-20241225145555607900000004-2024122514555622730000000d]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSComputePolicy"]: Refreshing state... [id=common-eks-cluster-20241225145555607300000003-2024122514555612400000000a]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSBlockStoragePolicy"]: Refreshing state... [id=common-eks-cluster-20241225145555607300000003-20241225145556107600000008]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSLoadBalancingPolicy"]: Refreshing state... [id=common-eks-cluster-20241225145555607300000003-2024122514555618190000000c]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSNetworkingPolicy"]: Refreshing state... [id=common-eks-cluster-20241225145555607300000003-20241225145556038100000006]
module.eks.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=common-eks-cluster-20241225145555607300000003-2024122514555616810000000b]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=common-eks-cluster-20241225145555607300000003-20241225145556123800000009]
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=892950211]
module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=50542654-3070-4cc1-88f8-ee0e364e19c9]
module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/common-eks]
module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::183631350996:policy/common-eks-cluster-ClusterEncryption2024122514561737980000000e]
module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=common-eks-cluster-20241225145555607300000003-2024122514561766460000000f]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0defd4a05283ed077]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-028391ed4b2f94c70]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0b4a17e3804b66187]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0ce61a30e68fa94ed]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0ed4e8742dc82a968]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0655294bfd4eacff4]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-04be5b0dbff42d923]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0378fc58ca5ea20fd]
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-0981ad3d51905c85d]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-083c83543c7e1d6a9]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-00ae6d9936e6af167]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0d2aa431ffd20c704]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0448e0c680c7ab54c]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-07c83b954352221c7]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0afd02ff7054227cf]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-00ae6d9936e6af1671080289494]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0a7e13a5e854e284d]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0011f7da90e3a83be]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0179c403db5d57af2]
module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-1997006141]
module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-2904145546]
module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-2138243038]
module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-3598296920]
module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-1062443038]
module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-2867298815]
module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-3192226475]
module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-3384315201]
module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-394325646]
module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-1915094199]
module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-203959093]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-042386b520ce4f729]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-006568a1017b1c3a1]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0de5137e51ace707f]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0b1b5a3ccc8fb46ab]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-04be5b0dbff42d9231080289494]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=common-eks]
module.eks.aws_eks_access_entry.this["cluster_creator"]: Refreshing state... [id=common-eks:arn:aws:iam::183631350996:role/IaC]
module.eks.data.tls_certificate.this[0]: Reading...
module.eks.time_sleep.this[0]: Refreshing state... [id=2024-12-25T15:07:42Z]
module.eks.data.tls_certificate.this[0]: Read complete after 0s [id=99d41e43229a4cdaf4141f3e8310e6d95c31dab9]
module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::183631350996:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/14E0BA107E21D8F5C3815669135D2529]
module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"]: Refreshing state... [id=common-eks#arn:aws:iam::183631350996:role/IaC#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.eks.aws_eks_access_entry.this["cluster_creator"] must be replaced
-/+ resource "aws_eks_access_entry" "this" {
      ~ access_entry_arn  = "arn:aws:eks:us-east-1:183631350996:access-entry/common-eks/role/183631350996/IaC/76c9ff2d-c670-fc48-95e8-65b72d1aa26a" -> (known after apply)
      ~ created_at        = "2024-12-25T15:07:13Z" -> (known after apply)
      ~ id                = "common-eks:arn:aws:iam::183631350996:role/IaC" -> (known after apply)
      ~ kubernetes_groups = [] -> (known after apply)
      ~ modified_at       = "2024-12-25T15:07:13Z" -> (known after apply)
      ~ principal_arn     = "arn:aws:iam::183631350996:role/IaC" -> "arn:aws:iam::183631350996:role/IaC-ReadOnly" # forces replacement
      - tags              = {} -> null
      ~ user_name         = "arn:aws:sts::183631350996:assumed-role/IaC/{{SessionName}}" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.eks.aws_eks_access_entry.this["root_user"] will be created
  + resource "aws_eks_access_entry" "this" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "common-eks"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::183631350996:root"
      + tags_all          = {
          + "Created_by"  = "Terraform"
          + "Environment" = "Common"
          + "Owner"       = "TF"
        }
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"] must be replaced
-/+ resource "aws_eks_access_policy_association" "this" {
      ~ associated_at = "2024-12-25 15:07:13.879 +0000 UTC" -> (known after apply)
      ~ id            = "common-eks#arn:aws:iam::183631350996:role/IaC#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy" -> (known after apply)
      ~ modified_at   = "2024-12-25 15:07:13.879 +0000 UTC" -> (known after apply)
      ~ principal_arn = "arn:aws:iam::183631350996:role/IaC" -> "arn:aws:iam::183631350996:role/IaC-ReadOnly" # forces replacement
        # (2 unchanged attributes hidden)

      ~ access_scope {
          - namespaces = [] -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.eks.module.kms.aws_kms_key.this[0] will be updated in-place
  ~ resource "aws_kms_key" "this" {
        id                                 = "50542654-3070-4cc1-88f8-ee0e364e19c9"
      ~ policy                             = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action    = "kms:*"
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::183631350996:root"
                        }
                        Resource  = "*"
                        Sid       = "Default"
                    },
                  ~ {
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::183631350996:role/IaC" -> "arn:aws:iam::183631350996:role/IaC-ReadOnly"
                        }
                        # (4 unchanged attributes hidden)
                    },
                    {
                        Action    = [
                            "kms:ReEncrypt*",
                            "kms:GenerateDataKey*",
                            "kms:Encrypt",
                            "kms:DescribeKey",
                            "kms:Decrypt",
                        ]
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::183631350996:role/common-eks-cluster-20241225145555607300000003"
                        }
                        Resource  = "*"
                        Sid       = "KeyUsage"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags                               = {
            "terraform-aws-modules" = "eks"
        }
        # (13 unchanged attributes hidden)
    }

Plan: 3 to add, 1 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @yashrajdighe, Action: `pull_request`, Working Directory: ``, Workflow: `terraform-plan`*